[
    {
        "id": 1,
        "paper_id": "2504.17149v1",
        "title": "Towards a Critical Pragmatic Philosophy of Sustainable Mathematics   Education",
        "abstract": "  This paper proposes critical pragmatism as a philosophy of sustainable mathematics education to bridge the gap between critical theory and the existing patchwork implementations. Combining existential sustainability as a holistic concept with pragmatic frameworks from the ethics in mathematics education literature creates a foundation enabling critical reflection and pragmatic implementation. We outline how their synthesis naturally leads to a three-stage implementation strategy: cultivating an ethical classroom culture, engaging with ethnomathematics, and tackling complex sustainability problems. Our critical pragmatic approach attempts to build a new philosophical perspective to equip teachers and students with the mathematical competencies, critical perspectives, and ethical grounding necessary to navigate and contribute to a sustainable future and to provide new analytic pathways. ",
        "published": "2025-04-24T00:02:24",
        "authors": "Dennis Müller",
        "comment": "22 pages",
        "category": "math.HO",
        "link": "http://arxiv.org/abs/2504.17149v1",
        "summary": "This paper advocates for a critical pragmatic philosophy of sustainable mathematics education to bridge the gap between critical theory and practical implementation.  It argues that current approaches to integrating sustainability into mathematics education are often superficial and lack critical engagement. The paper proposes a three-stage implementation strategy: fostering an ethical classroom culture, incorporating ethnomathematics, and addressing complex sustainability challenges. This approach aims to equip students and teachers with the mathematical skills, critical thinking abilities, and ethical understanding needed to contribute to a sustainable future.  The paper highlights the need to move beyond a solely critical approach to one that integrates critical insights with pragmatic action, thereby facilitating meaningful change in education and beyond.",
        "keywords": "Sustainable Mathematics Education, Critical Pragmatism, Existential Sustainability, Ethics in Mathematics Education, Ethnomathematics, Critical Theory, Pragmatism, Anthropocene, Sustainable Development Goals",
        "organizations": "University of Cologne"
    },
    {
        "id": 2,
        "paper_id": "2504.17150v1",
        "title": "DashGuide: Authoring Interactive Dashboard Tours for Guiding Dashboard   Users",
        "abstract": "  Dashboard guidance helps dashboard users better navigate interactive features, understand the underlying data, and assess insights they can potentially extract from dashboards. However, authoring dashboard guidance is a time consuming task, and embedding guidance into dashboards for effective delivery is difficult to realize. In this work, we contribute DashGuide, a framework and system to support the creation of interactive dashboard guidance with minimal authoring input. Given a dashboard and a communication goal, DashGuide captures a sequence of author-performed interactions to generate guidance materials delivered as playable step-by-step overlays, a.k.a., dashboard tours. Authors can further edit and refine individual tour steps while receiving generative assistance. We also contribute findings from a formative assessment with 9 dashboard creators, which helped inform the design of DashGuide; and findings from an evaluation of DashGuide with 12 dashboard creators, suggesting it provides an improved authoring experience that balances efficiency, expressiveness, and creative freedom. ",
        "published": "2025-04-24T00:04:54",
        "authors": "Naimul Hoque, Nicole Sultanum",
        "comment": "",
        "category": "cs.HC",
        "link": "http://arxiv.org/abs/2504.17150v1",
        "summary": "DASHGUIDE is a framework and system that simplifies the creation of interactive dashboard tours.  It leverages a large language model (LLM) to generate guidance materials based on author-selected interactions and a communication goal.  The system allows authors to create step-by-step interactive tours with minimal effort, offering the ability to refine the generated content and customize the tour.  Formative and evaluative assessments with dashboard creators indicate DASHGUIDE improves authoring experience by balancing efficiency, expressiveness, and creative freedom.",
        "keywords": "Dashboard guidance, interactive tours, large language model, human-computer interaction, visualization, dashboard authoring, user experience",
        "organizations": "University of Iowa, Tableau Research"
    },
    {
        "id": 3,
        "paper_id": "2504.17151v1",
        "title": "Robust Maximum Likelihood Updating",
        "abstract": "  There is a large body of evidence that decision makers frequently depart from Bayesian updating. This paper introduces a model, robust maximum likelihood (RML) updating, where deviations from Bayesian updating are due to multiple priors/ambiguity. Using the decision maker's preferences over acts before and after the arrival of new information as the primitive of the analysis, I axiomatically characterize a representation where the decision maker's probability assessment can be described by a benchmark prior, which is reflected in her ex ante ranking of acts, and a set of plausible priors, which is revealed from her updated preferences. When new information is received, the decision maker revises her benchmark prior within the set of plausible priors via the maximum likelihood principle in a way that ensures maximally dynamically consistent behavior, and updates the new prior using Bayes' rule. RML updating accommodates most commonly observed biases in probabilistic reasoning. ",
        "published": "2025-04-24T00:17:10",
        "authors": "Elchin Suleymanov",
        "comment": "",
        "category": "econ.TH",
        "link": "http://arxiv.org/abs/2504.17151v1",
        "summary": "This paper introduces a new model called Robust Maximum Likelihood (RML) updating to explain deviations from Bayesian updating observed in decision-making.  The model attributes these deviations to ambiguity or multiple priors.  It uses a benchmark prior (initial best guess) and a set of plausible priors to represent the decision maker's uncertainty.  Upon receiving new information, the model revises the benchmark prior within the plausible set using the maximum likelihood principle, ensuring dynamic consistency.  RML updating can explain various biases in probabilistic reasoning, such as base rate neglect, conservatism, and confirmation bias.",
        "keywords": "Non-Bayesian updating, multiple priors, ambiguity, maximum likelihood principle, dynamic consistency, Bayesian updating, decision-making, probabilistic reasoning",
        "organizations": "Purdue University"
    },
    {
        "id": 4,
        "paper_id": "2504.17152v1",
        "title": "Gaussian generally covariant hydrodynamics",
        "abstract": "  We develop a version of fluctuating relativistic hydrodynamics in a way very different from the usual derivation: Instead of treating it as a coarse-grained deterministic theory expanded in gradients of equilibrium quantities, we treat it as a stochastic theory, characterized by partition functions in each cells, expanded in cumulants. We show that the Gaussian ansatz allows us, via the gravitational Ward identities acting as a constraint between the variance and the average, to maintain full general covariance, with hydrodynamic flow emerging as an approximate Killing vector. If the symmetry of relativistic hydrodynamics, volume-preserving diffeomorphisms, is preserved, we show that linear response formulae are also generally covariant. We discuss our results and argue that in this approach, the applicability of the effective theory is parametrized around a very different quantity than the Knudsen number, offering hope of understanding the applicability of hydrodynamics to small systems. ",
        "published": "2025-04-24T00:18:20",
        "authors": "G. M. Sampaio, G. Rabelo-Soares, G. Torrieri",
        "comment": "",
        "category": "hep-th",
        "link": "http://arxiv.org/abs/2504.17152v1",
        "summary": "This paper presents a novel approach to relativistic fluctuating hydrodynamics, departing from the traditional gradient expansion of coarse-grained deterministic theories.  Instead, it utilizes a stochastic theory based on partition functions in each cell, expanded in cumulants.  A Gaussian ansatz, combined with gravitational Ward identities, ensures general covariance, with hydrodynamic flow emerging as an approximate Killing vector.  The authors demonstrate that if the symmetry of volume-preserving diffeomorphisms is preserved, linear response formulae remain generally covariant.  This approach offers a different parameterization of the effective theory's applicability, potentially resolving the challenges posed by the observation of hydrodynamics in small systems, where the Knudsen number is not necessarily small.",
        "keywords": "Relativistic hydrodynamics, fluctuating hydrodynamics, general covariance, Gaussian ansatz, gravitational Ward identities, Killing vector, linear response, effective field theory, Knudsen number, heavy ion collisions",
        "organizations": "NONE"
    },
    {
        "id": 5,
        "paper_id": "2504.17153v1",
        "title": "On the creation of conjugate points for thermostats",
        "abstract": "  Let $(M, g)$ be a closed oriented Riemannian surface, and let $SM$ be its unit tangent bundle. We show that the interior in the $\\mathcal{C}^2$ topology of the set of smooth functions $\\lambda:SM\\to \\mathbb{R}$ for which the thermostat $(M, g, \\lambda)$ has no conjugate points is a subset of those functions for which the thermostat is projectively Anosov. Moreover, we prove that if a reversible thermostat is projectively Anosov, then its non-wandering set contains no conjugate points. ",
        "published": "2025-04-24T00:18:51",
        "authors": "Javier Echevarría Cuesta, James Marshall Reber",
        "comment": "",
        "category": "math.DS",
        "link": "http://arxiv.org/abs/2504.17153v1",
        "summary": "This paper investigates the relationship between the absence of conjugate points and projective Anosov property in thermostat systems.  Thermostats are dynamical systems modeling particle motion under orthogonal forces, generalizing geodesic and magnetic flows. The authors demonstrate that for a Riemannian surface, the set of smooth functions defining thermostats without conjugate points is a subset of those defining projectively Anosov thermostats.  Further, they show that if a reversible thermostat is projectively Anosov, its non-wandering set lacks conjugate points.  The implications are significant for understanding the dynamics of non-conservative systems, as the absence of conjugate points is a key characteristic influencing the overall system behavior and its classification (e.g., Anosov systems).",
        "keywords": "Thermostat, Conjugate points, Projectively Anosov, Riemannian surface, Unit tangent bundle, Geodesic flow, Non-conservative dynamical systems",
        "organizations": "NONE"
    },
    {
        "id": 6,
        "paper_id": "2504.17154v1",
        "title": "Advancing Frontiers of Path Integral Theory for Stochastic Optimal   Control",
        "abstract": "  Stochastic Optimal Control (SOC) problems arise in systems influenced by uncertainty, such as autonomous robots or financial models. Traditional methods like dynamic programming are often intractable for high-dimensional, nonlinear systems due to the curse of dimensionality. This dissertation explores the path integral control framework as a scalable, sampling-based alternative. By reformulating SOC problems as expectations over stochastic trajectories, it enables efficient policy synthesis via Monte Carlo sampling and supports real-time implementation through GPU parallelization.   We apply this framework to six classes of SOC problems: Chance-Constrained SOC, Stochastic Differential Games, Deceptive Control, Task Hierarchical Control, Risk Mitigation of Stealthy Attacks, and Discrete-Time LQR. A sample complexity analysis for the discrete-time case is also provided. These contributions establish a foundation for simulator-driven autonomy in complex, uncertain environments. ",
        "published": "2025-04-24T00:22:13",
        "authors": "Apurva Patil",
        "comment": "",
        "category": "math.OC",
        "link": "http://arxiv.org/abs/2504.17154v1",
        "summary": "This dissertation explores the application of path integral theory to stochastic optimal control (SOC) problems.  Traditional methods for solving SOC problems, like dynamic programming, become computationally expensive for high-dimensional systems.  The path integral approach, based on the Feynman-Kac theorem, offers a computationally efficient alternative by transforming the problem into an expectation over system trajectories, enabling Monte Carlo sampling for policy computation.  The method's advantages include scalability (through GPU parallelization), applicability to non-linear systems, inherent robustness to uncertainties, and real-time policy generation. The dissertation applies this theory to six classes of SOC problems: chance-constrained SOC, two-player zero-sum stochastic differential games, deceptive control, task hierarchical control, risk mitigation of stealthy attack, and discrete-time stochastic linear quadratic regulator (LQR), and includes a sample complexity analysis for the discrete-time stochastic LQR problem.  The work contributes foundational knowledge for simulator-driven autonomy in complex SOC scenarios.",
        "keywords": "Stochastic Optimal Control, Path Integral Control, Feynman-Kac Theorem, Monte Carlo Sampling, Stochastic Differential Equations, High-Dimensional Systems, Non-linear Systems, GPU Parallelization, Chance-Constrained Control, Differential Games, Deceptive Control, Task Hierarchical Control, Risk Mitigation,  Linear Quadratic Regulator (LQR), Sample Complexity",
        "organizations": "The University of Texas at Austin"
    },
    {
        "id": 7,
        "paper_id": "2504.17155v1",
        "title": "Automotive Radar Multi-Frame Track-Before-Detect Algorithm Considering   Self-Positioning Errors",
        "abstract": "  This paper presents a method for the joint detection and tracking of weak targets in automotive radars using the multi-frame track-before-detect (MF-TBD) procedure. Generally, target tracking in automotive radars is challenging due to radar field of view (FOV) misalignment, nonlinear coordinate conversion, and self-positioning errors of the ego-vehicle, which are caused by platform motion. These issues significantly hinder the implementation of MF-TBD in automotive radars. To address these challenges, a new MF-TBD detection architecture is first proposed. It can adaptively adjust the detection threshold value based on the existence of moving targets within the radar FOV. Since the implementation of MF-TBD necessitates the inclusion of position, velocity, and yaw angle information of the ego-vehicle, each with varying degrees of measurement error, we further propose a multi-frame energy integration strategy for moving-platform radar and accurately derive the target energy integration path functions. The self-positioning errors of the ego-vehicle, which are usually not considered in some previous target tracking approaches, are well addressed. Numerical simulations and experimental results with real radar data demonstrate large detection and tracking gains over standard automotive radar processing in weak target environments. ",
        "published": "2025-04-24T00:27:25",
        "authors": "Wujun Li, Qing Miao, Ye Yuan, Yunlian Tian, Wei Yi, Kah Chan Teh",
        "comment": "",
        "category": "eess.SP",
        "link": "http://arxiv.org/abs/2504.17155v1",
        "summary": "This paper introduces a novel multi-frame track-before-detect (MF-TBD) algorithm for automotive radar systems designed to enhance the detection and tracking of weak targets.  The algorithm addresses challenges posed by self-positioning errors, radar field of view (FOV) misalignment, and nonlinear coordinate conversion inherent in automotive radar applications.  A key innovation is an adaptive detection threshold adjustment mechanism and a multi-frame energy integration strategy that accounts for ego-vehicle movement inaccuracies. Simulations and real radar data experiments demonstrate improved detection and tracking performance compared to standard detect-before-track (DBT) methods, especially in weak target scenarios.",
        "keywords": "Automotive Radar, Track-Before-Detect, Weak Target Detection, Multi-Frame Tracking, Self-Positioning Errors, Ego-Vehicle, Energy Integration, Adaptive Threshold",
        "organizations": "NONE"
    },
    {
        "id": 8,
        "paper_id": "2504.17156v1",
        "title": "Waveform-Logmel Audio Neural Networks for Respiratory Sound   Classification",
        "abstract": "  Auscultatory analysis using an electronic stethoscope has attracted increasing attention in the clinical diagnosis of respiratory diseases. Recently, neural networks have been applied to assist in respiratory sound classification with achievements. However, it remains challenging due to the scarcity of abnormal respiratory sound. In this paper, we propose a novel architecture, namely Waveform-Logmel audio neural networks (WLANN), which uses both waveform and log-mel spectrogram as the input features and uses Bidirectional Gated Recurrent Units (Bi-GRU) to context model the fused features. Experimental results of our WLANN applied to SPRSound respiratory dataset show that the proposed framework can effectively distinguish pathological respiratory sound classes, outperforming the previous studies, with 90.3% in sensitivity and 93.6% in total score. Our study demonstrates the high effectiveness of the WLANN in the diagnosis of respiratory diseases. ",
        "published": "2025-04-24T00:27:26",
        "authors": "Jiadong Xie, Yunlian Zhou, Mingsheng Xu",
        "comment": "",
        "category": "cs.SD",
        "link": "http://arxiv.org/abs/2504.17156v1",
        "summary": "This paper introduces Waveform-Logmel Audio Neural Networks (WLANN), a novel architecture for respiratory sound classification.  WLANN uses both waveform and log-mel spectrogram data as input features, leveraging a Bidirectional Gated Recurrent Unit (Bi-GRU) to model the fused features.  The model was tested on the SPRSound respiratory dataset and achieved superior performance compared to previous studies, with 90.3% sensitivity and 93.6% overall accuracy. This improvement is particularly notable in the classification of abnormal respiratory sounds (crackles and wheezes), which are crucial for accurate diagnosis. The implications are a significant advancement in automated auscultation for respiratory disease diagnosis, potentially improving accuracy and reliability compared to traditional methods reliant on clinician expertise.",
        "keywords": "respiratory sound classification, Waveform-Logmel audio neural networks, Bi-GRU, deep learning, medical audio, auscultation, respiratory disease diagnosis, crackles, wheezes",
        "organizations": "College of Integrated Circuits, State Key Laboratory of Silicon and Advanced Semiconductor Materials, Zhejiang University, Department of Pulmonology, Children’s Hospital Zhejiang University"
    },
    {
        "id": 9,
        "paper_id": "2504.17157v1",
        "title": "Ordered and Disordered Skyrmion States on a Square Substrate",
        "abstract": "  We examine the ordering of skyrmions interacting with a square substrate created from a modulation of anisotropy using atomistic simulations. We consider fillings of {\\it f} = 1.5, 2.0, 2.5, 3.0, and 3.5 skyrmions per potential minimum as a function of magnetic field and sample size. For a filling of {\\it f} = 2.0, we find various dimer orderings, such as tilted dimer states, as well as antiferromagnetic ordering that is similar to the colloidal dimer ordering seen on square substrates. The ability of the skyrmions to change shape or annihilate produces additional states that do not occur in the colloidal systems. For certain parameters at {\\it f} = 2.0, half of the skyrmions can annihilate to form a square lattice, or a superlattice of trimers and monomers containing skyrmions of different sizes can form. At lower fields, ordered stretched skyrmion states can appear, and for zero field, there can be ordered stripe states. For {\\it f} = 3.0, we find ferromagnetic ordered trimers, tilted lattices, columnar lattices, and stretched phases. For fillings of {\\it f} = 1.5 and 2.5, we find bipartite lattices, different ordered and disordered states, and several extended disordered regions produced by frustration effects. ",
        "published": "2025-04-24T00:27:32",
        "authors": "J. C. Bellizotti Souza, C. J. O. Reichhardt, C. Reichhardt, N. P. Vizarim, P. A. Venegas",
        "comment": "15 pages, 14 figures",
        "category": "cond-mat.mes-hall",
        "link": "http://arxiv.org/abs/2504.17157v1",
        "summary": "This paper uses atomistic simulations to investigate the ordering behavior of skyrmions interacting with a square substrate modulated by anisotropy.  The study focuses on varying skyrmion filling factors (f = 1.5, 2.0, 2.5, 3.0, 3.5) and explores how magnetic field and sample size influence the resulting structures.  At f = 2.0, diverse dimer orderings (tilted dimers, antiferromagnetic ordering) are observed, along with unique states arising from skyrmion shape changes and annihilation, unlike colloidal systems.  Other filling factors reveal a range of ordered and disordered states, including ferromagnetic trimers, tilted/columnar lattices, stretched phases, and bipartite lattices.  Frustration effects at non-integer fillings lead to extended disordered regions. The research provides insights into the complex interplay between particle-particle interactions and periodic substrate potentials in determining the final arrangement of skyrmions.",
        "keywords": "Skyrmions, Atomistic simulations, Square substrate, Anisotropy, Magnetic field, Filling factor, Dimer ordering, Trimer ordering, Ordered states, Disordered states, Frustration, Colloidal systems",
        "organizations": "POSMAT - Programa de P´os-Gradua¸c˜ao em Ciˆencia e Tecnologia de Materiais, S˜aoPaulo State University (UNESP), School of Sciences, Bauru, Brazil; Los Alamos National Laboratory, USA; “Gleb Wataghin” Institute of Physics, University of Campinas, S˜ao Paulo, Brazil; Department of Physics, S˜ao Paulo State University (UNESP), School of Sciences, Bauru, Brazil"
    },
    {
        "id": 10,
        "paper_id": "2504.17158v1",
        "title": "On the Reflective Symmetry of the Mother Graph",
        "abstract": "  A permutiple is a natural number whose representation in some base is an integer multiple of a number whose representation has the same collection of digits. Previous efforts have made progress on finding such numbers using graph-theoretical and finite-state-machine constructions. These are the mother graph and the Hoey-Sloane machine (and its state graph). In this paper, we use the reflective symmetry of the mother graph as a starting point for understanding relationships between permutiple classes and how new classes can be determined from old. Such results are not only useful for finding new permutiples from old, they help us to see previous work through a new lens. ",
        "published": "2025-04-24T00:33:11",
        "authors": "Benjamin V. Holt",
        "comment": "Submitted for review to Integers Electronic Journal of Combinatorial\n  Number Theory on April 21st, 2025",
        "category": "math.CO",
        "link": "http://arxiv.org/abs/2504.17158v1",
        "summary": "This paper explores permutiples, numbers that are integer multiples of a permutation of their digits.  Previous research used graph-theoretical and finite-state machine approaches to find permutiples. This paper focuses on the reflective symmetry of the 'mother graph,' a structure representing digit permutations in single-digit multiplications.  By analyzing this symmetry and its inheritance in the state graph (Hoey-Sloane graph), the authors aim to understand relationships between permutiple classes and develop methods for finding new permutiple classes from existing ones. The reflective symmetry provides a new framework for understanding and extending previous work on finding new permutiples from known ones.",
        "keywords": "Permutiple, Mother graph, Reflective symmetry, Hoey-Sloane graph, Finite-state machine, Graph theory, Number theory, Cyclic numbers, Palintiples, Transposable numbers",
        "organizations": "Department of Mathematics, Southwestern Oregon Community College"
    },
    {
        "id": 11,
        "paper_id": "2504.19395v1",
        "title": "ICL CIPHERS: Quantifying \"Learning'' in In-Context Learning via   Substitution Ciphers",
        "abstract": "  Recent works have suggested that In-Context Learning (ICL) operates in dual modes, i.e. task retrieval (remember learned patterns from pre-training) and task learning (inference-time ``learning'' from demonstrations). However, disentangling these the two modes remains a challenging goal. We introduce ICL CIPHERS, a class of task reformulations based on substitution ciphers borrowed from classic cryptography. In this approach, a subset of tokens in the in-context inputs are substituted with other (irrelevant) tokens, rendering English sentences less comprehensible to human eye. However, by design, there is a latent, fixed pattern to this substitution, making it reversible. This bijective (reversible) cipher ensures that the task remains a well-defined task in some abstract sense, despite the transformations. It is a curious question if LLMs can solve ICL CIPHERS with a BIJECTIVE mapping, which requires deciphering the latent cipher. We show that LLMs are better at solving ICL CIPHERS with BIJECTIVE mappings than the NON-BIJECTIVE (irreversible) baseline, providing a novel approach to quantify ``learning'' in ICL. While this gap is small, it is consistent across the board on four datasets and six models. Finally, we examine LLMs' internal representations and identify evidence in their ability to decode the ciphered inputs. ",
        "published": "2025-04-28T00:05:29",
        "authors": "Zhouxiang Fang, Aayush Mishra, Muhan Gao, Anqi Liu, Daniel Khashabi",
        "comment": "",
        "category": "cs.CL",
        "link": "http://arxiv.org/abs/2504.19395v1",
        "summary": "This paper introduces ICL CIPHERS, a novel method to quantify \"learning\" in In-Context Learning (ICL) for Large Language Models (LLMs).  ICL CIPHERS reformulates tasks using substitution ciphers, replacing tokens in the input with irrelevant ones while maintaining a reversible (bijective) mapping.  The authors hypothesize that LLMs' ability to solve these ciphered tasks reflects their capacity for task learning (as opposed to task retrieval). Experiments across four datasets and six LLMs demonstrate that models perform better on bijective ciphers than on irreversible ones, suggesting that LLMs exhibit a degree of inference-time learning. The consistent, albeit small, performance gap provides a new way to measure the learning component of ICL, offering insights into LLMs' internal representations and their ability to decode the ciphered inputs.",
        "keywords": "In-Context Learning, Large Language Models, Task Learning, Task Retrieval, Substitution Ciphers, Cryptography, Bijective Mapping, LLMs, ICL CIPHERS",
        "organizations": "Department of Computer Science, Johns Hopkins University"
    },
    {
        "id": 12,
        "paper_id": "2504.19396v1",
        "title": "Observational Learning with a Budget",
        "abstract": "  We consider a model of Bayesian observational learning in which a sequence of agents receives a private signal about an underlying binary state of the world. Each agent makes a decision based on its own signal and its observations of previous agents. A central planner seeks to improve the accuracy of these signals by allocating a limited budget to enhance signal quality across agents. We formulate and analyze the budget allocation problem and propose two optimal allocation strategies. At least one of these strategies is shown to maximize the probability of achieving a correct information cascade. ",
        "published": "2025-04-28T00:12:30",
        "authors": "Shuo Wu, Pawan Poojary, Randall Berry",
        "comment": "Submitted to ISIT 2025 Conference, 11 pages, 4 figures",
        "category": "cs.LG",
        "link": "http://arxiv.org/abs/2504.19396v1",
        "summary": "This paper examines Bayesian observational learning where agents sequentially make decisions based on private signals and observations of others.  A central planner allocates a limited budget to improve signal quality, aiming to increase the accuracy of these decisions and the probability of a correct information cascade. The authors formulate this budget allocation problem and propose two optimal allocation strategies, demonstrating that at least one maximizes the probability of a correct information cascade.  The implications suggest methods for optimizing information dissemination and decision-making in situations with limited resources, where improving initial information quality can significantly impact the overall outcome.",
        "keywords": "Bayesian observational learning, information cascades, budget allocation, information design, signal quality, optimal allocation strategies, correct information cascade",
        "organizations": "University of Illinois Chicago, Northwestern University"
    },
    {
        "id": 13,
        "paper_id": "2504.19397v1",
        "title": "Symmetric Policy Design for Multi-Agent Dispatch Coordination in Supply   Chains",
        "abstract": "  We study a decentralized dispatch coordination problem in a multi-agent supply chain setting with shared logistics capacity. We propose symmetric (identical) dispatch strategies for all agents, enabling efficient coordination without centralized control. Using a common information approach, we derive a dynamic programming solution that computes optimal symmetric dispatch strategies by transforming the multi-agent problem into a tractable dynamic program on the agents common information state. Simulation results demonstrate that our method significantly reduces coordination cost compared to baseline heuristics, including belief-based strategies and an always-dispatch policy. These findings highlight the benefits of combining symmetric strategy design with a common information-based dynamic programming framework for improving multi-agent coordination performance. ",
        "published": "2025-04-28T00:31:33",
        "authors": "Sagar Sudhakara",
        "comment": "",
        "category": "cs.MA",
        "link": "http://arxiv.org/abs/2504.19397v1",
        "summary": "This paper addresses the decentralized dispatch coordination problem in multi-agent supply chains with shared logistics capacity.  It proposes using symmetric (identical) dispatch strategies for all agents to achieve efficient coordination without centralized control.  A dynamic programming solution, based on a common information approach, is developed to compute optimal symmetric dispatch strategies.  Simulation results show that this method significantly reduces coordination costs compared to baseline heuristics, highlighting the benefits of symmetric strategy design combined with a common information-based dynamic programming framework for improving multi-agent coordination performance in supply chain logistics.  The symmetric policy offers advantages in fairness, scalability, and ease of implementation.",
        "keywords": "Multi-agent systems, Supply chain management, Dispatch coordination, Dynamic programming, Common information approach, Symmetric strategies, Decentralized control, Logistics, Capacity constraints",
        "organizations": "NONE"
    },
    {
        "id": 14,
        "paper_id": "2504.19398v1",
        "title": "Dynamic Arthroscopic Navigation System for Anterior Cruciate Ligament   Reconstruction Based on Multi-level Memory Architecture",
        "abstract": "  This paper presents a dynamic arthroscopic navigation system based on multi-level memory architecture for anterior cruciate ligament (ACL) reconstruction surgery. The system extends our previously proposed markerless navigation method from static image matching to dynamic video sequence tracking. By integrating the Atkinson-Shiffrin memory model's three-level architecture (sensory memory, working memory, and long-term memory), our system maintains continuous tracking of the femoral condyle throughout the surgical procedure, providing stable navigation support even in complex situations involving viewpoint changes, instrument occlusion, and tissue deformation. Unlike existing methods, our system operates in real-time on standard arthroscopic equipment without requiring additional tracking hardware, achieving 25.3 FPS with a latency of only 39.5 ms, representing a 3.5-fold improvement over our previous static system. For extended sequences (1000 frames), the dynamic system maintained an error of 5.3 plus-minus 1.5 pixels, compared to the static system's 12.6 plus-minus 3.7 pixels - an improvement of approximately 45 percent. For medium-length sequences (500 frames) and short sequences (100 frames), the system achieved approximately 35 percent and 19 percent accuracy improvements, respectively. Experimental results demonstrate the system overcomes limitations of traditional static matching methods, providing new technical support for improving surgical precision in ACL reconstruction. ",
        "published": "2025-04-28T00:37:15",
        "authors": "Shuo Wang, Weili Shi, Shuai Yang, Jiahao Cui, Qinwei Guo",
        "comment": "28 pages, 13 figures",
        "category": "cs.CV",
        "link": "http://arxiv.org/abs/2504.19398v1",
        "summary": "This paper introduces a dynamic arthroscopic navigation system for anterior cruciate ligament (ACL) reconstruction surgery.  Unlike previous static systems, this system uses a multi-level memory architecture (inspired by the Atkinson-Shiffrin model) to track the femoral condyle in real-time throughout the lengthy surgical procedure. This allows for continuous navigation despite challenges like changing viewpoints, instrument occlusion, and tissue deformation. The system works with standard arthroscopic equipment, achieving significant improvements in speed (3.5x faster than the previous static system) and accuracy (approximately 45% improvement in error for long sequences) compared to static image matching methods. This advancement offers improved surgical precision and potentially reduced complications in ACL reconstruction.",
        "keywords": "Anterior cruciate ligament reconstruction, arthroscopic navigation, dynamic tracking, multi-level memory architecture, computer-assisted surgery, image registration, real-time tracking, femoral condyle",
        "organizations": "Department of Engineering Physics, Tsinghua University, Department of Sports Medicine, Peking University Third Hospital, Institute of Sports Medicine of Peking University, Beijing Key Laboratory of Sports Injuries, State Key Laboratory of Virtual Reality Technology and Systems, Beihang University"
    },
    {
        "id": 15,
        "paper_id": "2504.19399v1",
        "title": "Follow Everything: A Leader-Following and Obstacle Avoidance Framework   with Goal-Aware Adaptation",
        "abstract": "  Robust and flexible leader-following is a critical capability for robots to integrate into human society. While existing methods struggle to generalize to leaders of arbitrary form and often fail when the leader temporarily leaves the robot's field of view, this work introduces a unified framework addressing both challenges. First, traditional detection models are replaced with a segmentation model, allowing the leader to be anything. To enhance recognition robustness, a distance frame buffer is implemented that stores leader embeddings at multiple distances, accounting for the unique characteristics of leader-following tasks. Second, a goal-aware adaptation mechanism is designed to govern robot planning states based on the leader's visibility and motion, complemented by a graph-based planner that generates candidate trajectories for each state, ensuring efficient following with obstacle avoidance. Simulations and real-world experiments with a legged robot follower and various leaders (human, ground robot, UAV, legged robot, stop sign) in both indoor and outdoor environments show competitive improvements in follow success rate, reduced visual loss duration, lower collision rate, and decreased leader-follower distance. ",
        "published": "2025-04-28T00:42:45",
        "authors": "Qianyi Zhang, Shijian Ma, Boyi Liu, Jingtai Liu, Jianhao Jiao, Dimitrios Kanoulas",
        "comment": "",
        "category": "cs.RO",
        "link": "http://arxiv.org/abs/2504.19399v1",
        "summary": "This paper presents a novel leader-following framework for robots that enhances robustness and flexibility.  Unlike existing methods that struggle with diverse leader types and temporary visibility loss, this framework uses a segmentation model (SAM2) to identify leaders of arbitrary shapes, eliminating the need for pre-defined leader categories.  A distance frame buffer improves tracking robustness by storing leader embeddings at multiple distances. A goal-aware adaptation mechanism manages robot planning states based on leader visibility and motion, using a graph-based planner for efficient trajectory generation and obstacle avoidance.  Experiments with a legged robot and various leader types (human, ground robot, UAV, legged robot, stop sign) in diverse environments demonstrate significant improvements in follow success rate, reduced visual loss, lower collision rates, and decreased leader-follower distance.",
        "keywords": "Leader-following, Obstacle avoidance, Robot navigation, Segmentation, Goal-aware adaptation, Robustness, Visual perception, Legged robot, SAM2",
        "organizations": "Nankai University, Hong Kong University of Science and Technology, University of Macau, University College London"
    },
    {
        "id": 16,
        "paper_id": "2504.19400v1",
        "title": "Geometry of efficient weight vectors",
        "abstract": "  Pairwise comparison matrices and the weight vectors obtained from them are important concepts in multi-criteria decision making. A weight vector corresponding to a pairwise comparison matrix is called Pareto efficient if the approximation of the matrix elements by the weight ratios cannot be improved for any element of the matrix without worsening it for an other element. The aim of this paper is to show the geometrical properties of the set of Pareto efficient weight vectors for $4\\times 4$ pairwise comparison matrices. ",
        "published": "2025-04-28T00:42:48",
        "authors": "Kristóf Ábele-Nagy, Sándor Bozóki, Zsombor Szádoczki",
        "comment": "",
        "category": "math.OC",
        "link": "http://arxiv.org/abs/2504.19400v1",
        "summary": "This paper investigates the geometrical properties of Pareto efficient weight vectors derived from 4x4 pairwise comparison matrices (PCMs) used in multi-criteria decision making.  A weight vector is considered Pareto efficient if no other vector can improve the approximation of matrix elements by weight ratios without worsening the approximation for another element. The research focuses on understanding the characteristics of the set of these efficient vectors, highlighting that even popular methods may yield inefficient results. This is important because finding efficient weight vectors ensures optimal representation of decision-maker preferences in multi-criteria decision analysis.",
        "keywords": "Pairwise comparison, Pareto optimality, Geometry, Multi-criteria decision making, Analytic Hierarchy Process, Weight vectors, Pairwise comparison matrices, Efficient weight vectors",
        "organizations": "Research Group of Operations Research and Decision Systems, Research Laboratory on Engineering & Management Intelligence, HUN-REN Institute for Computer Science and Control (SZTAKI), Department of Operations Research and Actuarial Sciences, Corvinus University of Budapest"
    },
    {
        "id": 17,
        "paper_id": "2504.19401v1",
        "title": "Innovative Integration of 4D Cardiovascular Reconstruction and Hologram:   A New Visualization Tool for Coronary Artery Bypass Grafting Planning",
        "abstract": "  Background: Coronary artery bypass grafting (CABG) planning requires advanced spatial visualization and consideration of coronary artery depth, calcification, and pericardial adhesions. Objective: To develop and evaluate a dynamic cardiovascular holographic visualization tool for preoperative CABG planning. Methods: Using 4D cardiac computed tomography angiography data from 14 CABG candidates, we developed a semi-automated workflow for time-resolved segmentation of cardiac structures, epicardial adipose tissue (EAT), and coronary arteries with calcium scoring. The workflow incorporated methods for cardiac segmentation, coronary calcification quantification, visualization of coronary depth within EAT, and pericardial adhesion assessment through motion analysis. Dynamic cardiovascular holograms were displayed using the Looking Glass platform. Thirteen cardiac surgeons evaluated the tool using a Likert scale. Additionally, pericardial adhesion scores from holograms of 21 patients (including seven undergoing secondary cardiac surgeries) were compared with intraoperative findings. Results: Surgeons rated the visualization tool highly for preoperative planning utility (mean Likert score: 4.57/5.0). Hologram-based pericardial adhesion scoring strongly correlated with intraoperative findings (r=0.786, P<0.001). Conclusion: This study establishes a visualization framework for CABG planning that produces clinically relevant dynamic holograms from patient-specific data, with clinical feedback confirming its effectiveness for preoperative planning. ",
        "published": "2025-04-28T00:56:06",
        "authors": "Shuo Wang, Tong Ren, Nan Cheng, Li Zhang, Rong Wang",
        "comment": "35 pages, 9 figures",
        "category": "physics.med-ph",
        "link": "http://arxiv.org/abs/2504.19401v1",
        "summary": "This study introduces a novel visualization tool for Coronary Artery Bypass Grafting (CABG) planning.  Using 4D cardiac computed tomography angiography (4D-CCTA) data, the researchers created a semi-automated workflow to reconstruct a dynamic 3D cardiovascular model and display it as a naked-eye hologram.  This hologram provides a detailed visualization of coronary arteries, including depth within the subepicardium, calcification levels, and pericardial adhesions.  Cardiac surgeons highly rated the tool's utility (mean Likert score 4.57/5.0), and hologram-based scoring of pericardial adhesions strongly correlated with intraoperative findings (r = 0.786, P < 0.001). The implications are that this innovative holographic visualization improves preoperative CABG planning, potentially leading to more accurate and efficient surgeries.",
        "keywords": "Hologram, 4D cardiovascular modeling, 4D cardiac CT angiogram, CABG, Preoperative planning, Coronary artery bypass grafting, Cardiac surgery, Visualization tool",
        "organizations": "Tsinghua University, PLA General Hospital, Chinese PLA Medical School"
    },
    {
        "id": 18,
        "paper_id": "2504.19402v1",
        "title": "Boosting 3D Liver Shape Datasets with Diffusion Models and Implicit   Neural Representations",
        "abstract": "  While the availability of open 3D medical shape datasets is increasing, offering substantial benefits to the research community, we have found that many of these datasets are, unfortunately, disorganized and contain artifacts. These issues limit the development and training of robust models, particularly for accurate 3D reconstruction tasks. In this paper, we examine the current state of available 3D liver shape datasets and propose a solution using diffusion models combined with implicit neural representations (INRs) to augment and expand existing datasets. Our approach utilizes the generative capabilities of diffusion models to create realistic, diverse 3D liver shapes, capturing a wide range of anatomical variations and addressing the problem of data scarcity. Experimental results indicate that our method enhances dataset diversity, providing a scalable solution to improve the accuracy and reliability of 3D liver reconstruction and generation in medical applications. Finally, we suggest that diffusion models can also be applied to other downstream tasks in 3D medical imaging. ",
        "published": "2025-04-28T00:56:18",
        "authors": "Khoa Tuan Nguyen, Francesca Tozzi, Wouter Willaert, Joris Vankerschaver, Nikdokht Rashidian, Wesley De Neve",
        "comment": "",
        "category": "cs.CV",
        "link": "http://arxiv.org/abs/2504.19402v1",
        "summary": "This paper addresses the limitations of existing 3D liver shape datasets, which are often disorganized and contain artifacts.  The authors propose a novel method to augment these datasets using diffusion models combined with implicit neural representations (INRs). Their approach leverages the generative capabilities of a HyperDiffusion model to create realistic and diverse 3D liver shapes, overcoming data scarcity and improving the accuracy of 3D liver reconstruction.  The use of INRs with a HyperNetwork architecture allows for efficient generation of diverse 3D liver models without retraining for each new object.  The experimental results demonstrate that this method enhances dataset diversity, leading to more robust and reliable 3D liver reconstruction and generation in medical applications.  The authors suggest the applicability of their method to other 3D medical imaging tasks.",
        "keywords": "3D liver generation, 3D liver reconstruction, Diffusion models, Implicit Neural Representations (INRs), HyperNetworks, HyperDiffusion, Medical imaging, 3D shape datasets, Data augmentation",
        "organizations": "IDLab, ELIS, Ghent University, Ghent, Belgium; Center for Biosystems and Biotech Data Science, Ghent University Global Campus, Incheon, Korea; Department of Applied Mathematics, Informatics, and Statistics, Ghent University, Ghent, Belgium; Department of GI Surgery, Ghent University Hospital, Ghent, Belgium; Department of HPB Surgery & Liver Transplantation, Ghent University Hospital, Ghent, Belgium; Department of Human Structure and Repair, Ghent University, Ghent, Belgium"
    },
    {
        "id": 19,
        "paper_id": "2504.19403v1",
        "title": "A topological quantum field theory for $\\mathrm{Spin}(7)$-instantons",
        "abstract": "  We construct a topological quantum field theory based on the moduli space of $\\mathrm{Spin}(7)$-instantons on 8-dimensional manifolds. Using the Mathai-Quillen formalism, we derive the action of the theory in purely geometric terms, which coincides with prior results in the literature. We then reformulate the theory within the AKSZ formalism, obtaining a Batalin-Vilkovisky action that, after gauge fixing, matches our Mathai-Quillen construction while making the BRST symmetry explicit and providing a natural framework for classical observables. We also show that the Batalin-Vilkovisky action can be elegantly recast as a Chern-Simons type theory. ",
        "published": "2025-04-28T00:58:31",
        "authors": "Rafael Herrera, Sergio A. Holguin Cardona, Alexander Quintero Velez",
        "comment": "31 pages, no figures",
        "category": "hep-th",
        "link": "http://arxiv.org/abs/2504.19403v1",
        "summary": "This paper constructs a topological quantum field theory (TQFT) based on the moduli space of Spin(7)-instantons on 8-dimensional manifolds.  The authors utilize the Mathai-Quillen formalism to derive the theory's action in geometric terms, aligning with previous literature.  They then reformulate the theory using the AKSZ formalism, resulting in a Batalin-Vilkovisky action that, after gauge fixing, matches the Mathai-Quillen construction. This approach explicitly reveals BRST symmetry and provides a framework for classical observables.  The paper also demonstrates that the Batalin-Vilkovisky action can be expressed as a Chern-Simons type theory.  The work builds upon Donaldson-Witten theory and extends its principles to higher dimensions.",
        "keywords": "Topological Quantum Field Theory, Spin(7)-instantons, Mathai-Quillen formalism, AKSZ formalism, Batalin-Vilkovisky action, BRST symmetry, Chern-Simons theory, Donaldson-Witten theory, Moduli space",
        "organizations": "NONE"
    },
    {
        "id": 20,
        "paper_id": "2504.19404v1",
        "title": "Limit distribution for sums of inhomogeneous Markovian Bernoulli   variables",
        "abstract": "  Let $\\{\\eta_i\\}_{i\\ge 1}$ be a sequence of dependent Bernoulli random variables. While the Poisson approximation for the distribution of $\\sum_{i=1}^n\\eta_i$ has been extensively studied in the literature, this paper establishes novel convergence regimes characterized by non-Poisson limits. Specifically, when $\\{\\eta_i\\}_{i\\ge 1}$ exhibits a Markovian dependence structure, we show that $\\sum_{i=1}^n\\eta_i,$ under appropriate scaling, converges almost surely or in distribution as $n\\to\\infty$ to a random variable with geometric or gamma distribution. As concrete applications, we derive the distribution of the number of times the population size in certain branching processes attains a given level. ",
        "published": "2025-04-28T01:03:22",
        "authors": "Hua-Ming Wang, Shuxiong Zhang",
        "comment": "25 pages",
        "category": "math.PR",
        "link": "http://arxiv.org/abs/2504.19404v1",
        "summary": "This paper investigates the limit distribution of sums of dependent Bernoulli random variables, specifically when these variables follow a Markovian dependence structure.  Unlike previous research focusing on Poisson approximations, this study reveals novel convergence regimes where the limit distribution is geometric or gamma, rather than Poisson.  The authors demonstrate this by analyzing the sum of Bernoulli variables under appropriate scaling as the number of variables goes to infinity.  The findings are applied to determine the distribution of population size in certain branching processes.",
        "keywords": "Dependent Bernoulli trials, Markovian dependence, Limit distribution, Geometric distribution, Gamma distribution, Branching processes, Chen-Stein method",
        "organizations": "School of Mathematics and Statistics, Anhui Normal University"
    },
    {
        "id": 21,
        "paper_id": "2505.19373v1",
        "title": "DiSa: Directional Saliency-Aware Prompt Learning for Generalizable   Vision-Language Models",
        "abstract": "  Prompt learning has emerged as a powerful paradigm for adapting vision-language models such as CLIP to downstream tasks. However, existing methods often overfit to seen data, leading to significant performance degradation when generalizing to novel classes or unseen domains. To address this limitation, we propose DiSa, a Directional Saliency-Aware Prompt Learning framework that integrates two complementary regularization strategies to enhance generalization. First, our Cross-Interactive Regularization (CIR) fosters cross-modal alignment by enabling cooperative learning between prompted and frozen encoders. Within CIR, a saliency-aware masking strategy guides the image encoder to prioritize semantically critical image regions, reducing reliance on less informative patches. Second, we introduce a directional regularization strategy that aligns visual embeddings with class-wise prototype features in a directional manner to prioritize consistency in feature orientation over strict proximity. This approach ensures robust generalization by leveraging stable prototype directions derived from class-mean statistics. Extensive evaluations on 11 diverse image classification benchmarks demonstrate that DiSa consistently outperforms state-of-the-art prompt learning methods across various settings, including base-to-novel generalization, cross-dataset transfer, domain generalization, and few-shot learning. ",
        "published": "2025-05-26T00:14:52",
        "authors": "Niloufar Alipour Talemi, Hossein Kashiani, Hossein R. Nowdeh, Fatemeh Afghah",
        "comment": "Accepted at the 31st ACM SIGKDD Conference on Knowledge Discovery and\n  Data Mining (KDD 2025)",
        "category": "cs.CV",
        "link": "http://arxiv.org/abs/2505.19373v1",
        "summary": "DiSa, a novel Directional Saliency-Aware Prompt Learning framework, addresses the overfitting issue in existing vision-language models like CLIP.  It achieves this through two key strategies: Cross-Interactive Regularization (CIR), which promotes cross-modal alignment using a saliency-aware masking technique to focus on semantically important image regions; and directional regularization, which aligns visual embeddings with class prototypes directionally, improving robustness.  Extensive experiments across 11 image classification benchmarks demonstrate DiSa's superior performance compared to state-of-the-art prompt learning methods in various generalization scenarios, including base-to-novel, cross-dataset transfer, domain generalization, and few-shot learning.",
        "keywords": "Vision-Language Models, Prompt Learning, Few-shot Learning, Domain Generalization, Cross-modal Alignment, Saliency-Aware Masking, Directional Regularization, Generalization",
        "organizations": "Clemson University"
    },
    {
        "id": 22,
        "paper_id": "2505.19374v1",
        "title": "Disorder-Induced Suppression of Antiferromagnetic Magnon Transport in   Cr2O3",
        "abstract": "  We explore the impact of spin disorder associated with structural defects on antiferromagnetic magnon transport by probing the spin-flop transition of Cr2O3 using spin Seebeck effect measurements. By fabricating homoepitaxial Cr2O3 films grown on smooth Cr2O3 crystals, we systematically vary the thickness of the films in which the presence of point defects modulates the spin-flop transition field. We find that magnon propagation through the film is entirely suppressed for film thickness greater than 3 nm, revealing the pivotal role of disorder in governing antiferromagnetic magnon transport. ",
        "published": "2025-05-26T00:16:58",
        "authors": "Josiah Keagy, Haoyu Liu, Junyu Tang, Weilun Tan, Wei Yuan, Sumukh Mahesh, Ran Cheng, Jing Shi",
        "comment": "",
        "category": "cond-mat.mtrl-sci",
        "link": "http://arxiv.org/abs/2505.19374v1",
        "summary": "This paper investigates the effect of spin disorder caused by structural defects on antiferromagnetic magnon transport in Cr2O3 thin films. Using the spin Seebeck effect (SSE), the researchers measured the spin-flop transition in Cr2O3 films of varying thicknesses.  They found that magnon propagation is completely suppressed in films thicker than 3 nm, demonstrating that disorder significantly impacts antiferromagnetic magnon transport.  This study highlights the importance of considering extrinsic factors, like defects, when interpreting SSE measurements and understanding antiferromagnetic magnon transport, particularly in the context of spintronics and quantum information technologies.",
        "keywords": "Antiferromagnetic magnon transport, Spin Seebeck effect, Cr2O3, Spin disorder, Spin-flop transition, Thin films, Defects, Spintronics, Quantum information technologies",
        "organizations": "Department of Physics & Astronomy, University of California, Riverside, Department of Electrical & Computer Engineering, University of California, Riverside"
    },
    {
        "id": 23,
        "paper_id": "2505.19375v1",
        "title": "Bounds for Moments of Dirichlet $L$-functions of fixed modulus on the   critical line",
        "abstract": "  We study the $2k$-th moment of the family of Dirichlet $L$-functions to a fixed prime modulus on the critical line and establish sharp lower bounds for all real $k \\geq 0$ and sharp upper bounds for $k$ in the range $0 \\leq k \\leq 1$. ",
        "published": "2025-05-26T00:19:54",
        "authors": "Peng Gao, Liangyi Zhao",
        "comment": "7 pages",
        "category": "math.NT",
        "link": "http://arxiv.org/abs/2505.19375v1",
        "summary": "This paper investigates the 2k-th moment of Dirichlet L-functions with a fixed prime modulus on the critical line.  The authors establish sharp lower bounds for all real k ≥ 0 and sharp upper bounds for 0 ≤ k ≤ 1.  This builds upon previous work concerning central values and extends it to the critical line.  The results are unconditional, unlike some prior work relying on the Generalized Riemann Hypothesis (GRH).  The findings contribute significantly to our understanding of the distribution of values of Dirichlet L-functions.",
        "keywords": "Dirichlet L-functions, moments, critical line, lower bounds, upper bounds, prime modulus, shifted moments",
        "organizations": "NONE"
    },
    {
        "id": 24,
        "paper_id": "2505.19376v1",
        "title": "Belief Attribution as Mental Explanation: The Role of Accuracy,   Informativity, and Causality",
        "abstract": "  A key feature of human theory-of-mind is the ability to attribute beliefs to other agents as mentalistic explanations for their behavior. But given the wide variety of beliefs that agents may hold about the world and the rich language we can use to express them, which specific beliefs are people inclined to attribute to others? In this paper, we investigate the hypothesis that people prefer to attribute beliefs that are good explanations for the behavior they observe. We develop a computational model that quantifies the explanatory strength of a (natural language) statement about an agent's beliefs via three factors: accuracy, informativity, and causal relevance to actions, each of which can be computed from a probabilistic generative model of belief-driven behavior. Using this model, we study the role of each factor in how people selectively attribute beliefs to other agents. We investigate this via an experiment where participants watch an agent collect keys hidden in boxes in order to reach a goal, then rank a set of statements describing the agent's beliefs about the boxes' contents. We find that accuracy and informativity perform reasonably well at predicting these rankings when combined, but that causal relevance is the single factor that best explains participants' responses. ",
        "published": "2025-05-26T00:21:38",
        "authors": "Lance Ying, Almog Hillel, Ryan Truong, Vikash K. Mansinghka, Joshua B. Tenenbaum, Tan Zhi-Xuan",
        "comment": "8 pages, 3 figures; oral presentation at CogSci 2025",
        "category": "cs.CL",
        "link": "http://arxiv.org/abs/2505.19376v1",
        "summary": "This paper explores how people attribute beliefs to others, focusing on the explanatory power of those beliefs.  The researchers hypothesize that people prefer attributing beliefs that best explain observed behavior. They develop a computational model that assesses explanatory strength based on accuracy, informativity, and causal relevance of a belief statement to the observed actions.  An experiment involving a treasure-hunt scenario and belief statement ranking showed that while accuracy and informativity contribute, causal relevance is the strongest predictor of belief attribution.",
        "keywords": "theory of mind, mental explanation, belief attribution, causal attribution, communication, social inference, Bayesian Theory-of-Mind, explanatory strength, natural language processing",
        "organizations": "Massachusetts Institute of Technology, Harvard University"
    },
    {
        "id": 25,
        "paper_id": "2505.19377v1",
        "title": "Absolute Coordinates Make Motion Generation Easy",
        "abstract": "  State-of-the-art text-to-motion generation models rely on the kinematic-aware, local-relative motion representation popularized by HumanML3D, which encodes motion relative to the pelvis and to the previous frame with built-in redundancy. While this design simplifies training for earlier generation models, it introduces critical limitations for diffusion models and hinders applicability to downstream tasks. In this work, we revisit the motion representation and propose a radically simplified and long-abandoned alternative for text-to-motion generation: absolute joint coordinates in global space. Through systematic analysis of design choices, we show that this formulation achieves significantly higher motion fidelity, improved text alignment, and strong scalability, even with a simple Transformer backbone and no auxiliary kinematic-aware losses. Moreover, our formulation naturally supports downstream tasks such as text-driven motion control and temporal/spatial editing without additional task-specific reengineering and costly classifier guidance generation from control signals. Finally, we demonstrate promising generalization to directly generate SMPL-H mesh vertices in motion from text, laying a strong foundation for future research and motion-related applications. ",
        "published": "2025-05-26T00:36:00",
        "authors": "Zichong Meng, Zeyu Han, Xiaogang Peng, Yiming Xie, Huaizu Jiang",
        "comment": "Preprint",
        "category": "cs.CV",
        "link": "http://arxiv.org/abs/2505.19377v1",
        "summary": "This paper challenges the conventional approach to text-to-motion generation, which relies on relative, kinematic-aware motion representations like those in HumanML3D.  The authors argue that this approach, while simplifying training for earlier models, limits the potential of diffusion models and hinders applicability to downstream tasks.  They propose a simpler alternative: using absolute joint coordinates in global space.  Their experiments demonstrate that this method achieves higher motion fidelity, better text alignment, and strong scalability, even with a basic Transformer architecture and without auxiliary kinematic-aware losses.  Furthermore, their approach readily supports downstream tasks like text-driven motion control and temporal/spatial editing without requiring additional modifications.  The authors also showcase promising results in directly generating SMPL-H mesh vertices from text, opening new avenues for future research.",
        "keywords": "Text-to-motion generation, human motion, diffusion models, absolute coordinates, motion representation, SMPL-H, Transformer, motion control, temporal editing, spatial editing",
        "organizations": "Northeastern University"
    },
    {
        "id": 26,
        "paper_id": "2505.19378v1",
        "title": "Residual Diffusivity for Expanding Bernoulli Maps",
        "abstract": "  Consider a discrete time Markov process $X^\\varepsilon$ on $\\mathbb{R}^d$ that makes a deterministic jump based on its current location, and then takes a small Gaussian step of variance $\\varepsilon^2$. We study the behavior of the asymptotic variance as $\\varepsilon \\to 0$. In some situations (for instance if there were no jumps), then the asymptotic variance vanishes as $\\varepsilon \\to 0$. When the jumps are \"chaotic\", however, the asymptotic variance may be bounded from above and bounded away from $0$, as $\\varepsilon \\to 0$. This phenomenon is known as residual diffusivity, and we prove this occurs when the jumps are determined by certain expanding Bernoulli maps. ",
        "published": "2025-05-26T00:36:02",
        "authors": "William Cooperman, Gautam Iyer, James Nolen",
        "comment": "18 pages, 2 figures",
        "category": "math.PR",
        "link": "http://arxiv.org/abs/2505.19378v1",
        "summary": "This paper investigates residual diffusivity in discrete-time Markov processes.  The process involves a deterministic jump based on the current location, followed by a small Gaussian step. The authors focus on the asymptotic variance as the Gaussian step's variance goes to zero.  They demonstrate that when the deterministic jumps are determined by expanding Bernoulli maps (a class of chaotic maps), a phenomenon called residual diffusivity occurs, where the asymptotic variance remains bounded away from zero. The main result establishes a formula for this limiting variance, showing it's nonzero if the map's image intersects multiple unit cubes.  This provides a rigorous proof of residual diffusivity for a specific class of chaotic maps, which is a novel contribution.",
        "keywords": "Residual diffusivity, Expanding Bernoulli maps, Markov processes, Asymptotic variance, Homogenization, Effective diffusivity, Mixing",
        "organizations": "National Science Foundation, Center for Nonlinear Analysis"
    },
    {
        "id": 27,
        "paper_id": "2505.19379v1",
        "title": "Neural nanophotonic object detector with ultra-wide field-of-view",
        "abstract": "  Intelligent object detection, which extracts crucial information like targets categories and locations, plays a vital role in emerging technologies including autonomous driving, the Internet of Things, and next-generation mobile communication systems. With the advancement of intelligent object detectors towards higher integration and miniaturization, their portability and adaptability to a broader range of scenarios have been significantly enhanced. However, this progress comes at the cost of reduced detection quality and narrower field-of-view, which severely impacts overall performances. Here we present a neural nanophotonic object detector based on a metalens array, capable of delivering high-quality imaging with an ultra-wide field-of-view of 135{\\deg}. The combined neural network not only further improves the imaging quality, but also enables the detector to achieve high-precision target recognition and localization. Moreover, we integrated the neural nanophotonic object detector into a miniature unmanned aerial vehicle to enable wide-angle imaging and intelligent recognition of various real-world dynamic objects, demonstrating the high mobility and flexibility of our neural nanophotonic object detector. Our study presents a systematic framework for advancing revolutionary intelligent detection systems, offering significant potential for a wide range of future applications. ",
        "published": "2025-05-26T00:43:29",
        "authors": "Ji Chen, Yue Wu, Muyang Li, Zhongyi Yuan, Zi-Wen Zhou, Cheng-Yao Hao, Bingcheng Zhu, Yin Wang, Jitao Ji, Chunyu Huang, Haobai Li, Yanxiang Zhang, Kai Qiu, Shining Zhu, Tao Li, Zaichen Zhang",
        "comment": "",
        "category": "physics.optics",
        "link": "http://arxiv.org/abs/2505.19379v1",
        "summary": "This paper introduces a neural nanophotonic object detector using a metalens array, achieving high-quality imaging with an ultra-wide 135° field-of-view.  A combined neural network enhances imaging quality and enables high-precision target recognition and localization.  The system's miniaturization allows integration into a UAV, demonstrating its mobility and flexibility for real-world object recognition. This research provides a framework for advanced intelligent detection systems with broad applications.",
        "keywords": "Neural nanophotonic object detector, metalens array, ultra-wide field-of-view, intelligent object detection, target recognition, localization, computer vision, unmanned aerial vehicle (UAV), miniaturization",
        "organizations": "School of Information Science and Engineering, National Mobile Communications Research Laboratory, Frontiers Science Center for Mobile Information Communication and Security, Quantum Information Research Center, Southeast University, Purple Mountain Laboratories, National Laboratory of Solid State Microstructures, College of Engineering and Applied Science, School of Physics, Nanjing University"
    },
    {
        "id": 28,
        "paper_id": "2505.19380v1",
        "title": "Experimental Approaches to Distinguishing Quantum Collapse from Unitary   Evolution: A Weak Measurement Perspective",
        "abstract": "  This paper proposes an experiment designed to distinguish between competing interpretations of quantum mechanics: those that involve wave function collapse and those that assume purely unitary evolution. The experiment tests whether an observer can measure a system without collapsing its wave function.   To this end, we introduce the concept of an unconscious observer, defined by two criteria: (1) It measures a quantum system and sets the state of another system based on the result. (2) It allows an external experimentalist to infer the measurement outcome by examining the observer's state. The more distinguishable the observer's resulting states, the more it resembles a conventional measurement apparatus. Using weak measurements, the experimentalist probes these states, thereby testing the second criterion.   The interference patterns observed in this setup reveal whether collapse has occurred, allowing experimental discrimination between collapse-based and unitary interpretations. ",
        "published": "2025-05-26T00:45:02",
        "authors": "Peter Renkel",
        "comment": "22 pages, 4 figures",
        "category": "quant-ph",
        "link": "http://arxiv.org/abs/2505.19380v1",
        "summary": "This paper proposes an experiment to differentiate between quantum interpretations with wavefunction collapse (e.g., Copenhagen) and those without (e.g., Many-Worlds).  It introduces the concept of an 'unconscious observer,' a system that measures a quantum system, records the result in its own state, and allows an external observer to infer that result.  Weak measurements are used to probe the observer's state, and the resulting interference patterns reveal whether collapse has occurred. This approach avoids the complexities of conscious observers in previous attempts to distinguish these interpretations.",
        "keywords": "Quantum mechanics, wavefunction collapse, unitary evolution, Many-Worlds Interpretation, Copenhagen Interpretation, weak measurement, unconscious observer, quantum measurement problem",
        "organizations": "NONE"
    },
    {
        "id": 29,
        "paper_id": "2505.19381v1",
        "title": "DiffVLA: Vision-Language Guided Diffusion Planning for Autonomous   Driving",
        "abstract": "  Research interest in end-to-end autonomous driving has surged owing to its fully differentiable design integrating modular tasks, i.e. perception, prediction and planing, which enables optimization in pursuit of the ultimate goal. Despite the great potential of the end-to-end paradigm, existing methods suffer from several aspects including expensive BEV (bird's eye view) computation, action diversity, and sub-optimal decision in complex real-world scenarios. To address these challenges, we propose a novel hybrid sparse-dense diffusion policy, empowered by a Vision-Language Model (VLM), called Diff-VLA. We explore the sparse diffusion representation for efficient multi-modal driving behavior. Moreover, we rethink the effectiveness of VLM driving decision and improve the trajectory generation guidance through deep interaction across agent, map instances and VLM output. Our method shows superior performance in Autonomous Grand Challenge 2025 which contains challenging real and reactive synthetic scenarios. Our methods achieves 45.0 PDMS. ",
        "published": "2025-05-26T00:49:35",
        "authors": "Anqing Jiang, Yu Gao, Zhigang Sun, Yiru Wang, Jijun Wang, Jinghao Chai, Qian Cao, Yuweng Heng, Hao Jiang, Zongzheng Zhang, Xianda Guo, Hao Sun, Hao Zhao",
        "comment": "4pages",
        "category": "cs.AI",
        "link": "http://arxiv.org/abs/2505.19381v1",
        "summary": "DiffVLA is a novel hybrid sparse-dense diffusion policy for autonomous driving guided by a Vision-Language Model (VLM).  It addresses limitations of existing end-to-end methods by improving efficiency (sparse BEV computation), handling action diversity (multi-modal diffusion), and enhancing decision-making in complex scenarios (VLM integration).  DiffVLA incorporates a VLM guidance module, a hybrid perception module (dense and sparse branches), and a diffusion-based planning module.  The method demonstrated superior performance in the Autonomous Grand Challenge 2025, achieving a PDMS of 45.0.",
        "keywords": "Autonomous driving, End-to-end learning, Vision-Language Model (VLM), Diffusion models, Sparse perception, Bird's Eye View (BEV), Trajectory planning, Multi-modal, Autonomous Grand Challenge 2025, PDMS",
        "organizations": "RIX, Bosch, AIR, Tsinghua University, Shanghai Tongji University, Shanghai University, Shanghai Jiao Tong University, Southeast University"
    },
    {
        "id": 30,
        "paper_id": "2505.19382v1",
        "title": "Retrospective Approximation Sequential Quadratic Programming for   Stochastic Optimization with General Deterministic Nonlinear Constraints",
        "abstract": "  In this paper, we propose a framework based on the Retrospective Approximation (RA) paradigm to solve optimization problems with a stochastic objective function and general nonlinear deterministic constraints. This framework sequentially constructs increasingly accurate approximations of the true problems which are solved to a specified accuracy via a deterministic solver, thereby decoupling the uncertainty from the optimization. Such frameworks retain the advantages of deterministic optimization methods, such as fast convergence, while achieving the optimal performance of stochastic methods without the need to redesign algorithmic components. For problems with general nonlinear equality constraints, we present a framework that can employ any deterministic solver and analyze its theoretical work complexity. We then present an instance of the framework that employs a deterministic Sequential Quadratic Programming (SQP) method and that achieves optimal complexity in terms of gradient evaluations and linear system solves for this class of problems. For problems with general nonlinear constraints, we present an RA-based algorithm that employs an SQP method with robust subproblems. Finally, we demonstrate the empirical performance of the proposed framework on multi-class logistic regression problems and benchmark instances from the CUTEst test set, comparing its results to established methods from the literature. ",
        "published": "2025-05-26T00:50:41",
        "authors": "Albert S. Berahas, Raghu Bollapragada, Shagun Gupta",
        "comment": "63 pages, 9 figures",
        "category": "math.OC",
        "link": "http://arxiv.org/abs/2505.19382v1",
        "summary": "This paper introduces a Retrospective Approximation (RA) framework for solving stochastic optimization problems with general nonlinear deterministic constraints.  The framework builds increasingly accurate approximations of the problem, solved using a deterministic solver, decoupling uncertainty from optimization.  This retains the advantages of deterministic methods (like fast convergence) while achieving optimal stochastic performance without algorithmic redesign. The authors present a framework adaptable to any deterministic solver, analyzing its complexity, and specifically detail an implementation using Sequential Quadratic Programming (SQP).  They demonstrate the method's effectiveness on multi-class logistic regression and CUTEst benchmark problems, comparing it to existing techniques.",
        "keywords": "Stochastic Optimization, Nonlinear Constraints, Retrospective Approximation, Sequential Quadratic Programming, Deterministic Optimization, Complexity Analysis, Machine Learning, Optimization Algorithms",
        "organizations": "University of Michigan, University of Texas at Austin"
    }
]